In [1]:
import pandas as pd

df = pd.read_csv("../Dataset/NIFTY50_CLEANED.csv")
df.head()

         Date     Open     High      Low   Close
0  2000-01-03  1482.15  1592.90  1482.15  1592.2
1  2000-01-04  1594.40  1641.95  1594.40  1638.7
2  2000-01-05  1634.55  1635.50  1555.05  1595.8
3  2000-01-06  1595.80  1639.00  1595.80  1617.6
4  2000-01-07  1616.60  1628.25  1597.20  1613.3

In [2]:
df['Daily_Return_%'] = df['Close'].pct_change() * 100
df.head()

         Date     Open     High      Low   Close  Daily_Return_%
0  2000-01-03  1482.15  1592.90  1482.15  1592.2             NaN
1  2000-01-04  1594.40  1641.95  1594.40  1638.7        2.920487
2  2000-01-05  1634.55  1635.50  1555.05  1595.8       -2.617929
3  2000-01-06  1595.80  1639.00  1595.80  1617.6        1.366086
4  2000-01-07  1616.60  1628.25  1597.20  1613.3       -0.265826

In [3]:
df[['Date', 'Close', 'Daily_Return_%']].head()

         Date   Close  Daily_Return_%
0  2000-01-03  1592.2             NaN
1  2000-01-04  1638.7        2.920487
2  2000-01-05  1595.8       -2.617929
3  2000-01-06  1617.6        1.366086
4  2000-01-07  1613.3       -0.265826

In [4]:
df['MA_20'] = df['Close'].rolling(window=20).mean()
df.head(25)

          Date     Open     High      Low   Close  Daily_Return_%     MA_20
0   2000-01-03  1482.15  1592.90  1482.15  1592.2             NaN       NaN
1   2000-01-04  1594.40  1641.95  1594.40  1638.7        2.920487       NaN
2   2000-01-05  1634.55  1635.50  1555.05  1595.8       -2.617929       NaN
3   2000-01-06  1595.80  1639.00  1595.80  1617.6        1.366086       NaN
4   2000-01-07  1616.60  1628.25  1597.20  1613.3       -0.265826       NaN
5   2000-01-10  1615.65  1662.10  1614.95  1632.9        1.214901       NaN
6   2000-01-11  1633.25  1639.90  1548.25  1572.5       -3.698941       NaN
7   2000-01-12  1572.30  1631.55  1571.70  1624.8        3.325914       NaN
8   2000-01-13  1627.85  1671.15  1613.65  1621.4       -0.209257       NaN
9   2000-01-14  1622.15  1627.40  1591.40  1622.7        0.080178       NaN
10  2000-01-17  1623.50  1668.45  1604.65  1611.6       -0.684045       NaN
11  2000-01-18  1611.65  1615.15  1587.85  1606.7       -0.304046       NaN
12  2000-01-19  1610.05  1644.45  1608.85  1634.8        1.748926       NaN
13  2000-01-20  1634.65  1644.40  1596.65  1601.1       -2.061414       NaN
14  2000-01-21  1601.25  1626.50  1593.20  1620.6        1.217913       NaN
15  2000-01-24  1623.05  1645.00  1608.30  1613.6       -0.431939       NaN
16  2000-01-25  1612.95  1613.65  1579.55  1586.4       -1.685672       NaN
17  2000-01-27  1600.50  1633.55  1600.05  1603.9        1.103127       NaN
18  2000-01-28  1603.65  1610.90  1592.70  1599.1       -0.299271       NaN
19  2000-01-31  1598.35  1598.35  1538.70  1546.2       -3.308111  1607.795
20  2000-02-01  1546.20  1554.15  1521.40  1549.5        0.213426  1605.660
21  2000-02-02  1554.20  1605.90  1554.20  1588.0        2.484672  1603.125
22  2000-02-03  1591.25  1616.70  1591.25  1597.9        0.623426  1603.230
23  2000-02-04  1598.50  1621.35  1596.45  1599.7        0.112648  1602.335
24  2000-02-07  1599.80  1645.90  1599.80  1636.6        2.306683  1603.500

In [5]:
df.to_csv("../Dataset/NIFTY50_TRANSFORMED.csv", index=False)

In [6]:
pd.read_csv("../Dataset/NIFTY50_TRANSFORMED.csv").head()

         Date     Open     High      Low   Close  Daily_Return_%  MA_20
0  2000-01-03  1482.15  1592.90  1482.15  1592.2             NaN    NaN
1  2000-01-04  1594.40  1641.95  1594.40  1638.7        2.920487    NaN
2  2000-01-05  1634.55  1635.50  1555.05  1595.8       -2.617929    NaN
3  2000-01-06  1595.80  1639.00  1595.80  1617.6        1.366086    NaN
4  2000-01-07  1616.60  1628.25  1597.20  1613.3       -0.265826    NaN